# -*- coding: utf-8 -*-
import time
import random
from history201712 import History201712


class History201708(History201712) :
    bid_people = 269189
    title = "2017年7月22日"
    cards = 10325
    TIME_HISTORY =[
        ["11:29:59", 92200, "2017-07-22 11:29:57"],
        ["11:29:58", 92100, "2017-07-22 11:29:53"],
        ["11:29:57", 92100, "2017-07-22 11:29:54"],
        ["11:29:56", 92100, "2017-07-22 11:29:55"],
        ["11:29:55", 92000, "2017-07-22 11:29:52"],
        ["11:29:54", 91900, "2017-07-22 11:29:51"],
        ["11:29:53", 91800, "2017-07-22 11:29:50"],
        ["11:29:52", 91700, "2017-07-22 11:29:50"],
        ["11:29:51", 91600, "2017-07-22 11:29:49"],
        ["11:29:50", 91500, "2017-07-22 11:29:47"],
        ["11:29:49", 91400, "2017-07-22 11:29:44"],
        ["11:29:48", 91400, "2017-07-22 11:29:46"],
        ["11:29:47", 91300, "2017-07-22 11:29:42"],
        ["11:29:46", 91200, "2017-07-22 11:29:38"],
        ["11:29:45", 91100, "2017-07-22 11:29:35"],
        ["11:29:44", 91100, "2017-07-22 11:29:43"],
        ["11:29:43", 91000, "2017-07-22 11:29:23"],
        ["11:29:42", 91000, "2017-07-22 11:29:26"],
        ["11:29:41", 91000, "2017-07-22 11:29:29"],
        ["11:29:40", 91000, "2017-07-22 11:29:33"],
        ["11:29:39", 91000, "2017-07-22 11:29:35"],
        ["11:29:38", 91000, "2017-07-22 11:29:37"],
        ["11:29:37", 90900, "2017-07-22 11:29:24"],
        ["11:29:36", 90800, "2017-07-22 11:29:15"],
        ["11:29:35", 90800, "2017-07-22 11:29:22"],
        ["11:29:34", 90700, "2017-07-22 11:28:37"],
        ["11:29:33", 90700, "2017-07-22 11:28:44"],
        ["11:29:32", 90700, "2017-07-22 11:28:49"],
        ["11:29:31", 90700, "2017-07-22 11:28:52"],
        ["11:29:30", 90700, "2017-07-22 11:28:55"],
        ["11:29:29", 90700, "2017-07-22 11:28:58"],
        ["11:29:28", 90700, "2017-07-22 11:29:02"],
        ["11:29:27", 90700, "2017-07-22 11:29:05"],
        ["11:29:26", 90700, "2017-07-22 11:29:06"],
        ["11:29:25", 90700, "2017-07-22 11:29:07"],
        ["11:29:24", 90700, "2017-07-22 11:29:08"],
        ["11:29:23", 90700, "2017-07-22 11:29:08"],
        ["11:29:22", 90700, "2017-07-22 11:29:09"],
        ["11:29:21", 90700, "2017-07-22 11:29:09"],
        ["11:29:20", 90700, "2017-07-22 11:29:10"],
        ["11:29:19", 90700, "2017-07-22 11:29:11"],
        ["11:29:18", 90700, "2017-07-22 11:29:12"],
        ["11:29:17", 90700, "2017-07-22 11:29:13"],
        ["11:29:16", 90700, "2017-07-22 11:29:14"],
        ["11:29:15", 90600, "2017-07-22 11:28:22"],
        ["11:29:14", 90600, "2017-07-22 11:28:34"],
        ["11:29:13", 90600, "2017-07-22 11:28:57"],
        ["11:29:12", 90500, "2017-07-22 11:28:07"],
        ["11:29:11", 90500, "2017-07-22 11:28:15"],
        ["11:29:10", 90500, "2017-07-22 11:28:24"],
        ["11:29:09", 90400, "2017-07-22 11:25:25"],
        ["11:29:08", 90400, "2017-07-22 11:25:49"],
        ["11:29:07", 90400, "2017-07-22 11:26:07"],
        ["11:29:06", 90400, "2017-07-22 11:26:20"],
        ["11:29:05", 90400, "2017-07-22 11:26:29"],
        ["11:29:04", 90400, "2017-07-22 11:26:35"],
        ["11:29:03", 90400, "2017-07-22 11:26:39"],
        ["11:29:02", 90400, "2017-07-22 11:26:44"],
        ["11:29:01", 90400, "2017-07-22 11:26:48"],
        ["11:29:00", 90400, "2017-07-22 11:26:52"],
    ]
    IMAGE_CODES = [
        ["0009", "输入绿色背景的四位数字", "yzm1707/g0009.png"],
        ["0298", "输入绿色背景的四位数字", "yzm1707/g0298.png"],
        ["0385", "输入绿色背景的四位数字", "yzm1707/g0385.png"],
        ["0673", "输入绿色背景的四位数字", "yzm1707/g0673.png"],
        ["0843", "输入绿色背景的四位数字", "yzm1707/g0843.png"],
        ["1091", "输入绿色背景的四位数字", "yzm1707/g1091.png"],
        ["1118", "输入绿色背景的四位数字", "yzm1707/g1118.png"],
        ["1297", "输入绿色背景的四位数字", "yzm1707/g1297.png"],
        ["1317", "输入绿色背景的四位数字", "yzm1707/g1317.png"],
        ["1362", "输入绿色背景的四位数字", "yzm1707/g1362.png"],
        ["1422", "输入绿色背景的四位数字", "yzm1707/g1422.png"],
        ["1444", "输入绿色背景的四位数字", "yzm1707/g1444.png"],
        ["1486", "输入绿色背景的四位数字", "yzm1707/g1486.png"],
        ["1695", "输入绿色背景的四位数字", "yzm1707/g1695.png"],
        ["1701", "输入绿色背景的四位数字", "yzm1707/g1701.png"],
        ["1970", "输入绿色背景的四位数字", "yzm1707/g1970.png"],
        ["2030", "输入绿色背景的四位数字", "yzm1707/g2030.png"],
        ["2044", "输入绿色背景的四位数字", "yzm1707/g2044.png"],
        ["2130", "输入绿色背景的四位数字", "yzm1707/g2130.png"],
        ["2465", "输入绿色背景的四位数字", "yzm1707/g2465.png"],
        ["2600", "输入绿色背景的四位数字", "yzm1707/g2600.png"],
        ["2867", "输入绿色背景的四位数字", "yzm1707/g2867.png"],
        ["3044", "输入绿色背景的四位数字", "yzm1707/g3044.png"],
        ["3576", "输入绿色背景的四位数字", "yzm1707/g3576.png"],
        ["3903", "输入绿色背景的四位数字", "yzm1707/g3903.png"],
        ["5043", "输入绿色背景的四位数字", "yzm1707/g5043.png"],
        ["6950", "输入绿色背景的四位数字", "yzm1707/g6950.png"],
        ["7462", "输入绿色背景的四位数字", "yzm1707/g7462.png"],
        ["7554", "输入绿色背景的四位数字", "yzm1707/g7554.png"],
        ["7651", "输入绿色背景的四位数字", "yzm1707/g7651.png"],
        ["7770", "输入绿色背景的四位数字", "yzm1707/g7770.png"],
        ["7802", "输入绿色背景的四位数字", "yzm1707/g7802.png"],
        ["7850", "输入绿色背景的四位数字", "yzm1707/g7850.png"],
        ["7907", "输入绿色背景的四位数字", "yzm1707/g7907.png"],
        ["8058", "输入绿色背景的四位数字", "yzm1707/g8058.png"],
        ["8770", "输入绿色背景的四位数字", "yzm1707/g8770.png"],
        ["9145", "输入绿色背景的四位数字", "yzm1707/g9145.png"],
        ["9251", "输入绿色背景的四位数字", "yzm1707/g9251.png"],
        ["9600", "输入绿色背景的四位数字", "yzm1707/g9600.png"],
        ["9682", "输入绿色背景的四位数字", "yzm1707/g9682.png"],
        ["9801", "输入绿色背景的四位数字", "yzm1707/g9801.png"],
        ["9923", "输入绿色背景的四位数字", "yzm1707/g9923.png"],
        ["9993", "输入绿色背景的四位数字", "yzm1707/g9993.png"],
        ["0387", "输入橙色背景的四位数字", "yzm1707/o0387.png"],
        ["0855", "输入橙色背景的四位数字", "yzm1707/o0855.png"],
        ["1050", "输入橙色背景的四位数字", "yzm1707/o1050.png"],
        ["1122", "输入橙色背景的四位数字", "yzm1707/o1122.png"],
        ["1133", "输入橙色背景的四位数字", "yzm1707/o1133.png"],
        ["1200", "输入橙色背景的四位数字", "yzm1707/o1200.png"],
        ["1215", "输入橙色背景的四位数字", "yzm1707/o1215.png"],
        ["1238", "输入橙色背景的四位数字", "yzm1707/o1238.png"],
        ["1279", "输入橙色背景的四位数字", "yzm1707/o1279.png"],
        ["1364", "输入橙色背景的四位数字", "yzm1707/o1364.png"],
        ["1384", "输入橙色背景的四位数字", "yzm1707/o1384.png"],
        ["1415", "输入橙色背景的四位数字", "yzm1707/o1415.png"],
        ["1565", "输入橙色背景的四位数字", "yzm1707/o1565.png"],
        ["1630", "输入橙色背景的四位数字", "yzm1707/o1630.png"],
        ["1668", "输入橙色背景的四位数字", "yzm1707/o1668.png"],
        ["1780", "输入橙色背景的四位数字", "yzm1707/o1780.png"],
        ["1786", "输入橙色背景的四位数字", "yzm1707/o1786.png"],
        ["1831", "输入橙色背景的四位数字", "yzm1707/o1831.png"],
        ["1932", "输入橙色背景的四位数字", "yzm1707/o1932.png"],
        ["1983", "输入橙色背景的四位数字", "yzm1707/o1983.png"],
        ["2014", "输入橙色背景的四位数字", "yzm1707/o2014.png"],
        ["2095", "输入橙色背景的四位数字", "yzm1707/o2095.png"],
        ["2200", "输入橙色背景的四位数字", "yzm1707/o2200.png"],
        ["2802", "输入橙色背景的四位数字", "yzm1707/o2802.png"],
        ["2962", "输入橙色背景的四位数字", "yzm1707/o2962.png"],
        ["3091", "输入橙色背景的四位数字", "yzm1707/o3091.png"],
        ["3335", "输入橙色背景的四位数字", "yzm1707/o3335.png"],
        ["3449", "输入橙色背景的四位数字", "yzm1707/o3449.png"],
        ["3514", "输入橙色背景的四位数字", "yzm1707/o3514.png"],
        ["3944", "输入橙色背景的四位数字", "yzm1707/o3944.png"],
        ["4129", "输入橙色背景的四位数字", "yzm1707/o4129.png"],
        ["4149", "输入橙色背景的四位数字", "yzm1707/o4149.png"],
        ["4858", "输入橙色背景的四位数字", "yzm1707/o4858.png"],
        ["4930", "输入橙色背景的四位数字", "yzm1707/o4930.png"],
        ["5003", "输入橙色背景的四位数字", "yzm1707/o5003.png"],
        ["5416", "输入橙色背景的四位数字", "yzm1707/o5416.png"],
        ["5436", "输入橙色背景的四位数字", "yzm1707/o5436.png"],
        ["5513", "输入橙色背景的四位数字", "yzm1707/o5513.png"],
        ["5582", "输入橙色背景的四位数字", "yzm1707/o5582.png"],
        ["6037", "输入橙色背景的四位数字", "yzm1707/o6037.png"],
        ["6332", "输入橙色背景的四位数字", "yzm1707/o6332.png"],
        ["6444", "输入橙色背景的四位数字", "yzm1707/o6444.png"],
        ["6503", "输入橙色背景的四位数字", "yzm1707/o6503.png"],
        ["6547", "输入橙色背景的四位数字", "yzm1707/o6547.png"],
        ["7293", "输入橙色背景的四位数字", "yzm1707/o7293.png"],
        ["7723", "输入橙色背景的四位数字", "yzm1707/o7723.png"],
        ["8099", "输入橙色背景的四位数字", "yzm1707/o8099.png"],
        ["8948", "输入橙色背景的四位数字", "yzm1707/o8948.png"],
        ["9201", "输入橙色背景的四位数字", "yzm1707/o9201.png"],
        ["9297", "输入橙色背景的四位数字", "yzm1707/o9297.png"],
        ["9703", "输入橙色背景的四位数字", "yzm1707/o9703.png"],
        ["9891", "输入橙色背景的四位数字", "yzm1707/o9891.png"],
        ["0073", "输入紫色背景的四位数字", "yzm1707/p0073.png"],
        ["0331", "输入紫色背景的四位数字", "yzm1707/p0331.png"],
        ["0610", "输入紫色背景的四位数字", "yzm1707/p0610.png"],
        ["0814", "输入紫色背景的四位数字", "yzm1707/p0814.png"],
        ["0828", "输入紫色背景的四位数字", "yzm1707/p0828.png"],
        ["0959", "输入紫色背景的四位数字", "yzm1707/p0959.png"],
        ["1096", "输入紫色背景的四位数字", "yzm1707/p1096.png"],
        ["1112", "输入紫色背景的四位数字", "yzm1707/p1112.png"],
        ["1124", "输入紫色背景的四位数字", "yzm1707/p1124.png"],
        ["1142", "输入紫色背景的四位数字", "yzm1707/p1142.png"],
        ["1216", "输入紫色背景的四位数字", "yzm1707/p1216.png"],
        ["1415", "输入紫色背景的四位数字", "yzm1707/p1415.png"],
        ["1425", "输入紫色背景的四位数字", "yzm1707/p1425.png"],
        ["1560", "输入紫色背景的四位数字", "yzm1707/p1560.png"],
        ["1596", "输入紫色背景的四位数字", "yzm1707/p1596.png"],
        ["1616", "输入紫色背景的四位数字", "yzm1707/p1616.png"],
        ["1681", "输入紫色背景的四位数字", "yzm1707/p1681.png"],
        ["1688", "输入紫色背景的四位数字", "yzm1707/p1688.png"],
        ["1691", "输入紫色背景的四位数字", "yzm1707/p1691.png"],
        ["1764", "输入紫色背景的四位数字", "yzm1707/p1764.png"],
        ["1798", "输入紫色背景的四位数字", "yzm1707/p1798.png"],
        ["1806", "输入紫色背景的四位数字", "yzm1707/p1806.png"],
        ["1817", "输入紫色背景的四位数字", "yzm1707/p1817.png"],
        ["1874", "输入紫色背景的四位数字", "yzm1707/p1874.png"],
        ["1885", "输入紫色背景的四位数字", "yzm1707/p1885.png"],
        ["1889", "输入紫色背景的四位数字", "yzm1707/p1889.png"],
        ["2065", "输入紫色背景的四位数字", "yzm1707/p2065.png"],
        ["2137", "输入紫色背景的四位数字", "yzm1707/p2137.png"],
        ["2523", "输入紫色背景的四位数字", "yzm1707/p2523.png"],
        ["3005", "输入紫色背景的四位数字", "yzm1707/p3005.png"],
        ["3035", "输入紫色背景的四位数字", "yzm1707/p3035.png"],
        ["3077", "输入紫色背景的四位数字", "yzm1707/p3077.png"],
        ["3242", "输入紫色背景的四位数字", "yzm1707/p3242.png"],
        ["3404", "输入紫色背景的四位数字", "yzm1707/p3404.png"],
        ["3753", "输入紫色背景的四位数字", "yzm1707/p3753.png"],
        ["3966", "输入紫色背景的四位数字", "yzm1707/p3966.png"],
        ["4993", "输入紫色背景的四位数字", "yzm1707/p4993.png"],
        ["5062", "输入紫色背景的四位数字", "yzm1707/p5062.png"],
        ["5356", "输入紫色背景的四位数字", "yzm1707/p5356.png"],
        ["5439", "输入紫色背景的四位数字", "yzm1707/p5439.png"],
        ["5823", "输入紫色背景的四位数字", "yzm1707/p5823.png"],
        ["5977", "输入紫色背景的四位数字", "yzm1707/p5977.png"],
        ["6139", "输入紫色背景的四位数字", "yzm1707/p6139.png"],
        ["6197", "输入紫色背景的四位数字", "yzm1707/p6197.png"],
        ["6338", "输入紫色背景的四位数字", "yzm1707/p6338.png"],
        ["7068", "输入紫色背景的四位数字", "yzm1707/p7068.png"],
        ["7250", "输入紫色背景的四位数字", "yzm1707/p7250.png"],
        ["7577", "输入紫色背景的四位数字", "yzm1707/p7577.png"],
        ["7859", "输入紫色背景的四位数字", "yzm1707/p7859.png"],
        ["7922", "输入紫色背景的四位数字", "yzm1707/p7922.png"],
        ["7938", "输入紫色背景的四位数字", "yzm1707/p7938.png"],
        ["8837", "输入紫色背景的四位数字", "yzm1707/p8837.png"],
        ["8989", "输入紫色背景的四位数字", "yzm1707/p8989.png"],
        ["9838", "输入紫色背景的四位数字", "yzm1707/p9838.png"]
    ]
    for i in range(len(IMAGE_CODES)):
        IMAGE_CODES[i][2] = "http://51moni-sh.oss-cn-shanghai.aliyuncs.com/" + IMAGE_CODES[i][2]


    #把timehistory转变为字典
    TIME_HISTORY_DICT = {}
    for each in TIME_HISTORY:
        TIME_HISTORY_DICT[each[0]] = each[1:]
    































    
        
